[
    {
        "company": "Uplers",
        "title": "Full Stack Developer – ReactJS | React Native | Node.js",
        "prefrences": [
            "Remote",
            "Full-time"
        ],
        "description": "About the job\nExperience: 5.00 + years\n\nSalary: Confidential (based on experience)\n\nExpected Notice Period: 15 Days\n\nShift: (GMT+05:30) Asia/Kolkata (IST)\n\nOpportunity Type: Remote\n\nPlacement Type: Full Time Contract for 3 Months(40 hrs a week/160 hrs a month)\n\n(*Note: This is a requirement for one of Uplers' client - Driven Data Solutions Provider)\n\nWhat do you need for this opportunity?\n\nMust have skills required:\n\nAI, Analytics, Ci/Cd Pipelines, cloud deployment, API Integrations, authentication flows, Qlik, ReactJs, token-based security, .NET Core, Node Js, React Native\n\nDriven Data Solutions Provider is Looking for: \n\nAbout The Role\n\nWe’re looking for a skilled Full Stack Developer with solid experience in ReactJS, React Native, and Node.js (Express, Hapi, or NestJS). You’ll be working on modern mobile and web applications that integrate tightly with third-party platforms — especially Qlik APIs, our primary analytics engine. The ideal candidate enjoys building scalable frontends and robust backend services, has experience working with cloud infrastructure, and is confident in integrating external APIs to create seamless user experiences.\n\nTech Stack- \n\nFrontend- ReactJS, React Native, JavaScript/TypeScript, MUI, Redux\nBackend & APIs- Node.js (Express, Hapi, NestJS)\nREST APIs, WebSockets, JWT, OAuth2, OpenID Connect\nFamiliarity with .NET Core is a plus\n\n\nQlik & Integrations\n\nIntegration with Qlik SaaS APIs (Capability API, REST, Enigma.js)\nHandling authentication, bookmarks, selections, data objects, and embedded analytics\n\n\nCloud & DevOps\n\nAzure App Services, AWS Lambda, CloudFront\nCI/CD: GitHub Actions, Azure DevOps\nDocker, basic Terraform knowledge is a plus\n\n\nData & Messaging\n\nPostgreSQL, MongoDB, DynamoDB\nPub/Sub or Event-based workflows (e.g., with Firebase, Kafka, or custom services)\n\n\nWhat You'll Do\n\n Develop and maintain cross-platform apps using React Native and ReactJS\n Build scalable backend services and REST APIs in Node.js\n Integrate with Qlik APIs to deliver analytics-driven experiences\n Handle user authentication and session flows via OAuth/OpenID\n Implement CI/CD pipelines and monitor cloud deployments\n Collaborate closely with designers and backend teams\n\n\nSoft Skills\n\n Strong ownership of frontend-to-backend workflows\n Comfortable navigating and integrating complex third-party APIs\n Effective communicator across teams and roles\n Curious, adaptive, and eager to explore new tools (AI, automation, etc.)\n Agile mindset with hands-on problem-solving attitude\n\n\nQualifications\n\n Experience in full stack development\n Proven skills in ReactJS, React Native, and Node.js frameworks\n Experience with API integrations, ideally Qlik or similar analytics tools\n Solid understanding of authentication flows and token-based security\n Familiarity with cloud deployment and CI/CD pipelines\n Bonus: Exposure to .NET Core, or interest in analytics/AI use cases\n\n\nHow to apply for this opportunity?\n\nStep 1: Click On Apply! And Register or Login on our portal.\nStep 2: Complete the Screening Form & Upload updated Resume\nStep 3: Increase your chances to get shortlisted & meet the client for the Interview!\n\n\nAbout Uplers:\n\nOur goal is to make hiring reliable, simple, and fast. Our role will be to help all our talents find and apply for relevant contractual onsite opportunities and progress in their career. We will support any grievances or challenges you may face during the engagement.\n\n(Note: There are many more opportunities apart from this on the portal. Depending on the assessments you clear, you can apply for them as well).\n\nSo, if you are ready for a new challenge, a great work environment, and an opportunity to take your career to the next level, don't hesitate to apply today. We are waiting for you!\n\nDesired Skills and Experience\nAI, Analytics, Ci/Cd Pipelines, cloud deployment, API Integrations, authentication flows, Qlik, ReactJs, token-based security, .NET Core, Node Js, React Native"
    },
    {
        "company": "Turing",
        "title": "Remote Full-Stack Developer",
        "prefrences": [
            "Remote",
            "Full-time"
        ],
        "description": "About the job\nAre you passionate about coding and eager to work on cutting-edge projects?\n\nA US-based client is looking for experienced developers with strong JavaScript or TypeScript skills to join their dynamic team. This role offers the opportunity to collaborate with global companies on AI-driven solutions, tackle complex challenges, and continuously enhance your skills in a fast-paced environment.\n\nWhat You’ll Do\n\nWrite clean, reusable, and maintainable code.\nParticipate in code reviews to ensure high-quality standards.\nDevelop scalable, modular web applications with a focus on security and stability.\nCollaborate with teams to build advanced AI-driven solutions.\nDeliver well-structured and documented code.\n\nWhat We’re Looking For\n\nOpen to applicants of all levels, from junior to industry experts.\nBachelor’s or Master’s degree in Computer Science, Engineering, or equivalent experience.\nStrong understanding of ES6 and frameworks like Node.js or React.\nKnowledge of front-end, back-end, or full-stack development.\nInterest in building scalable, secure web applications with clean architecture.\nGood spoken and written communication skills in English.\n\nNice To Have\n\nFamiliarity with additional frameworks like Vue.js, Angular, or Nest.js.\nUnderstanding of software quality assurance and test planning.\n\nWhat We Offer\n\nWork with leading experts worldwide and expand your professional network.\nThis is a contractual remote work opportunity without traditional job constraints.\nCompetitive salary based on global industry standards.\nExposure to innovative projects at the forefront of technology.\n\nInterview Process\n\nShortlisted developers may be asked to complete an assessment.\nIf you clear the assessment, you will be contacted for contract assignments with expected start dates, durations, and end dates.\nSome contract assignments require fixed weekly hours, averaging 20/30/40 hours per week for the duration of the contract assignment."
    },
    {
        "company": "BairesDev",
        "title": "Full Stack Developer - React + Node - Remote Work | REF#283082",
        "prefrences": [
            "Remote",
            "Full-time"
        ],
        "description": "About the job\nAt BairesDev®, we've been leading the way in technology projects for over 15 years. We deliver cutting-edge solutions to giants like Google and the most innovative startups in Silicon Valley.\n\nOur diverse 4,000+ team, composed of the world's Top 1% of tech talent, works remotely on roles that drive significant impact worldwide.\n\nWhen you apply for this position, you're taking the first step in a process that goes beyond the ordinary. We aim to align your passions and skills with our vacancies, setting you on a path to exceptional career development and success.\n\nFull Stack Developer - React + Node at BairesDev\n\nWe are looking for a Full Stack Developer with experience in React and Node.js to join our development team. In this role, you'll be responsible for building responsive web applications, implementing frontend interfaces and backend functionality, and collaborating with cross-functional teams to deliver high-quality solutions.\n\nWhat You'll Do\n\n Develop modern web applications using React and Node.js.\n Implement RESTful APIs for communication between frontend and backend.\n Build and optimize state management solutions using Redux or Context API.\n Create and maintain database integrations with SQL databases, particularly PostgreSQL.\n Participate in code reviews and implement best practices.\n Collaborate with design and product teams to deliver user-friendly features.\n\nWhat We Are Looking For\n\n 3+ years of experience with React.\n Proficiency in TypeScript.\n Experience with Node.js for backend development.\n Knowledge of RESTful API design and implementation.\n Experience with state management using Redux and/or Context API.\n Familiarity with SQL databases, particularly PostgreSQL.\n Advanced level of English.\n\nNice To Have\n\n Experience with AWS ecosystem services.\n Knowledge of containerization with Docker.\n Familiarity with AWS Bedrock.\n Experience with Infrastructure as Code.\n\nHow we do make your work (and your life) easier:\n\n 100% remote work (from anywhere).\n Excellent compensation in USD or your local currency if preferred\n Hardware and software setup for you to work from home.\n Flexible hours: create your own schedule.\n Paid parental leaves, vacations, and national holidays.\n Innovative and multicultural work environment: collaborate and learn from the global Top 1% of talent.\n Supportive environment with mentorship, promotions, skill development, and diverse growth opportunities.\n\nJoin a global team where your unique talents can truly thrive!"
    },
    {
        "company": "Uplers",
        "title": "Senior / Lead Full-Stack Engineer (AI-Accelerated)",
        "prefrences": [
            "$44.4K/yr",
            "Remote",
            "Full-time"
        ],
        "description": "About the job\nExperience: 4.00 + years\n\nSalary: USD 3703 / month (based on experience)\n\nExpected Notice Period: 15 Days\n\nShift: (GMT+05:30) Asia/Kolkata (IST)\n\nOpportunity Type: Remote\n\nPlacement Type: Full Time Contract for 6 Months(40 hrs a week/160 hrs a month)\n\n(*Note: This is a requirement for one of Uplers' client - PT)\n\nWhat do you need for this opportunity?\n\nMust have skills required:\n\nAML/KYC, Implemented Stripe, Infrastructure-as-code (Terraform, or other compliance-driven, or similar payment flows., Paddle, Pulumi) and secure SDLC practices., sanctions-screening, Experience deploying and operating workloads on Vercel or GCP, Next.js & React, Supabase, PostgreSQL, TypeScript, Node\n\nPT is Looking for: \n\nSenior / Lead Full-Stack Engineer (AI-Accelerated)\n\nFull Time\n\nWhy this role exists\n\nOne of our client projects is building a next-generation platform moving from prototype\n\nto production release. We need a senior engineer to own the build—shipping features\n\nfast, integrating third-party services, hardening for security and compliance. The\n\ndeveloper must be comfortable with utilising AI tooling (Bolt, v0, Cursor, Claude Code,\n\nGitHub Copilot) into everyday development. We will of course provide all necessary\n\naccounts / licensing.\n\nWhat You’ll Do\n\nPrototype & core feature delivery\n\nStrengthen and extend the existing prototype built with Next.js / React\n\n(TypeScript), backed by PostgreSQL / Supabase.\n\nRefine onboarding, risk-scoring, case-management, and reporting workflows.\n\nProduct expansion & integrations\n\nAdd KYC/AML data sources, payment processing, advanced authentication (MFA,\n\nSSO), alert/notification channels, and domain association.\n\nDrive end-to-end testing, security controls, and regulated-industry compliance.\n\nAI-accelerated engineering\n\nUse Cursor, Claude, Copilot, etc. for code generation, test scaffolding, migration\n\nscripts, documentation, and quick architectural prototypes.\n\nPrototype AI-powered product capabilities (e.g., suspicious-activity insights,\n\nnatural-language rule builders).\n\nArchitecture & DevOps\n\nDesign, deploy, and operate scalable infrastructure—hosting may be on Vercel or\n\nGoogle Cloud Platform (GCP)—with CI/CD, observability, performance tuning, and\n\ncost optimisation.\n\nTechnical leadership & collaboration\n\nPartner with the Solution Architect / Product Manager on backlog grooming,\n\nworkshops, and agile ceremonies.\n\nEstablish coding standards, lead code reviews, mentor teammates, and foster a\n\nproduct-engineering mindset.\n\nMust-have Qualifications\n\n4+ years professional software development, including 2 + years in a senior or\n\nlead capacity.\n\nProduction expertise with Next.js & React, strict TypeScript, and modern\n\nstate-management patterns.\n\nDeep SQL & schema design on PostgreSQL plus hands-on Supabase (RLS,\n\nFunctions, Auth).\n\nExperience deploying and operating workloads on Vercel or GCP .\n\nDaily user of Cursor, Claude (Code), GitHub Copilot or comparable AI coding\n\nassistants.\n\nTrack record of shipping in agile, product-led startup environments—balancing\n\nspeed with maintainability.\n\nExcellent written & spoken English for crisp specs, PRs, and stakeholder\n\ncommunication.\n\nNice-to-haves\n\nAML/KYC, Sanctions-screening, Or Other Compliance-driven Systems Experience.\n\nImplemented Stripe, Paddle, or similar payment flows.\n\nBuilt notification pipelines with Twilio, OneSignal, or equivalent.\n\nFamiliarity with LLM fine-tuning / retrieval-augmented generation and vector\n\ndatabases.\n\nInfrastructure-as-code (Terraform, Pulumi) and secure SDLC practices.\n\nSuccess measures\n\nPrototype evolved into a feature-complete, user-validated application.\n\nIntegrations, payments, and advanced auth live in staging and ready for\n\nproduction.\n\nCycle time and defect rate reduced through AI-assisted workflows we will\n\ndevelop\n\nComprehensive test coverage, security posture, and monitoring dashboards\n\nestablished\n\nHow to apply for this opportunity?\n\nStep 1: Click On Apply! And Register or Login on our portal.\nStep 2: Complete the Screening Form & Upload updated Resume\nStep 3: Increase your chances to get shortlisted & meet the client for the Interview!\n\n\nAbout Uplers:\n\nOur goal is to make hiring reliable, simple, and fast. Our role will be to help all our talents find and apply for relevant contractual onsite opportunities and progress in their career. We will support any grievances or challenges you may face during the engagement.\n\n(Note: There are many more opportunities apart from this on the portal. Depending on the assessments you clear, you can apply for them as well).\n\nSo, if you are ready for a new challenge, a great work environment, and an opportunity to take your career to the next level, don't hesitate to apply today. We are waiting for you!\n\nDesired Skills and Experience\nAML/KYC, Implemented Stripe, Infrastructure-as-code (Terraform, or other compliance-driven, or similar payment flows., Paddle, Pulumi) and secure SDLC practices., sanctions-screening, Experience deploying and operating workloads on Vercel or GCP, Next.js & React, Supabase, PostgreSQL, TypeScript, Node"
    }
]