[
    {
        "job-title": "Senior Front-End Developer (React) Remote",
        "company-name": "Uplers",
        "preferences": [
            "$35K/yr",
            "Remote",
            "Full-time"
        ],
        "date-posted": "Reposted 3 days ago",
        "responsibility": "*   Lead the development of cutting-edge web applications using React to improve user experiences.\n*   Collaborate closely with UI/UX designers to create accessible, intuitive, and visually appealing interfaces.\n*   Optimize performance using advanced React techniques (code-splitting, lazy loading, tree-shaking) to ensure fast load times and scalability.\n*   Integrate with RESTful, OData, and GraphQL APIs, ensuring seamless data flow and robust functionality.\n*   Mentor and guide junior developers, fostering a collaborative and innovative environment.\n*   Deploy React applications using Azure Static Web Apps, optimizing the deployment process via CI/CD pipelines in GitHub Actions.\n*   Continuously test and debug to ensure code quality and application stability.",
        "requirement": "*   6+ years of front-end development experience with React\n*   Strong proficiency in JavaScript (ES6+)\n*   HTML5\n*   CSS3\n*   State management tools (e.g., Redux, Context API)\n*   Git\n*   Webpack\n*   Component libraries (e.g., Material-UI, Tailwind CSS)\n*   Testing frameworks (e.g., Jest, Cypress)\n*   Building scalable, maintainable codebases\n*   TypeScript\n*   Server-side rendering (Next.js is a plus)\n*   Experience deploying web applications to Azure Static Web Apps\n*   OData services\n*   RESTful APIs\n*   GraphQL\n*   CI/CD pipelines (GitHub Actions)\n*   Micro-frontend architecture\n*   Docker\n*   Kubernetes\n*   Progressive Web Applications (PWA)",
        "job-link": "https://www.linkedin.com/jobs/collections/recommended/?currentJobId=4291254013"
    },
    {
        "job-title": "Remote Full-Stack Developer",
        "company-name": "Turing",
        "preferences": [
            "Remote",
            "Full-time"
        ],
        "date-posted": "Reposted 1 week ago",
        "responsibility": "* Write clean, reusable, and maintainable code.\n* Participate in code reviews to ensure high-quality standards.\n* Develop scalable, modular web applications with a focus on security and stability.\n* Collaborate with teams to build advanced AI-driven solutions.\n* Deliver well-structured and documented code.",
        "requirement": "*   Open to applicants of all levels, from junior to industry experts.\n*   Bachelor’s or Master’s degree in Computer Science, Engineering, or equivalent experience.\n*   Strong understanding of ES6 and frameworks like Node.js or React.\n*   Knowledge of front-end, back-end, or full-stack development.\n*   Interest in building scalable, secure web applications with clean architecture.\n*   Good spoken and written communication skills in English.",
        "job-link": "https://www.linkedin.com/jobs/collections/recommended/?currentJobId=4273386039"
    },
    {
        "job-title": "Senior Drupal & PHP Developer with ASP.NET",
        "company-name": "Braintrust",
        "preferences": [
            "Remote",
            "Full-time"
        ],
        "date-posted": "2 days ago",
        "responsibility": "* Develop and maintain applications using Drupal (latest version) and PHP.\n* Contribute to ASP.NET development with a minimum of 5 years of proven experience.\n* Support production Drupal platforms, especially those integrated with ASP.NET.\n* Participate in Drupal + PHP upgrade projects.\n* Customize PHP within Drupal to meet specific requirements.\n* Troubleshoot and resolve issues in Drupal + PHP production environments.\n* Collaborate with global teams during overlapping US Central Time working hours.",
        "requirement": "* Minimum 2 years of hands-on development experience with Drupal & PHP (latest version)\n* At least 5 years of experience with ASP.NET development\n* Prior experience in production Drupal environments\n* Experience in Drupal environments integrated with ASP.NET (preferred)\n* Strong problem-solving skills for production issue troubleshooting\n* Experience in Drupal + PHP upgrade projects (desirable)\n* Knowledge of other CMS systems (a plus)",
        "job-link": "https://www.linkedin.com/jobs/collections/recommended/?currentJobId=4302104610"
    },
    {
        "job-title": "[AS177] Senior PHP Laravel Developer (Remote, Full-Time)",
        "company-name": "Smart Working",
        "preferences": [
            "Remote",
            "Full-time"
        ],
        "date-posted": "2 weeks ago",
        "responsibility": "*   Collaborate with the engineering team to complete backend projects using PHP and Laravel\n*   Troubleshoot and fix issues in PHP applications; identify root causes and verify fixes\n*   Design and implement greenfield systems with Laravel, writing clean and maintainable code\n*   Build and maintain RESTful APIs and integrations\n*   Use Git effectively (branching, pull requests, reviews) to support collaborative workflows",
        "requirement": "*   Bachelor’s degree in Computer Science, Engineering, or a related discipline (or equivalent practical experience)\n*   4+ years of professional experience in software development\n*   PHP & Laravel: 3+ years building production applications\n*   Working understanding of REST APIs, including design, debugging, and integration\n*   Proficiency with Git version control in collaborative development environments",
        "job-link": "https://www.linkedin.com/jobs/collections/recommended/?currentJobId=4294471786"
    }
]